Validation/planarLayer/meshDependency-dielec-conduct/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

phase1
{
    transportModel  Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 6.1e-05;
    rho             rho [1 -3 0 0 0 0 0] 900;
    sgm             sgm [-1 -3 3 0 0 2 0] 1e-3;
    eps             eps [-1 -3 4 0 0 2 0] 3e-12;

}

phase2
{
    transportModel  Newtonian;
    nu              nu [0 2 -1 0 0 0 0] 1.48e-05;
    rho             rho [1 -3 0 0 0 0 0] 1;
    sgm             sgm [-1 -3 3 0 0 2 0] 1e-50;
    eps             eps [-1 -3 4 0 0 2 0] 1e-12;
//    sgm             sgm [-1 -3 3 0 0 2 0] 0;
//    eps             eps [-1 -3 4 0 0 2 0] 1e-12;

}

sigma           sigma [ 1 0 -2 0 0 0 0 ] 0.073;


// ************************************************************************* //
